ttps://www.python.org/downloads/
github.com

Даны три числа a, b и c. Найти среднее геометрическое этих чисел, если все они отличны от нуля, и среднее арифметическое в противном случае.
О каждом учащемся класса известны его пол, год рождения, рост и вес. Определить, сколько в классе мальчиков и сколько девочек.
Найти средний возраст мальчиков и девочек.
 
Определить, верно ли, что самый высокий мальчик весит больше всех в классе, а самая маленькая девочка является самой юной среди девочек.


Сформировать одномерный список целых чисел A, используя генератор случайных чисел (диапазон от 0 до 99). Размер списка n ввести с клавиатуры. В соответствии со своим вариантом написать программу по условию, представленному в таблице ниже.

Удалить элементы, индексы которых кратны 7.

"""
masdel = []
i = 0
while i < len(mas):
    if i!=0 and i % 3 == 0:
        masdel.append(mas[i])
        del mas[i]
    else:
        i += 1
print('Вывод список после удаления элементов: ' + str(mas))
print('Вывод удаленных элементов: ' + str(masdel))